In [4]:
import pandas as pd
import numpy as np

In [5]:
data = pd.read_csv("./Location.csv")

In [6]:
type(data)

pandas.core.frame.DataFrame

In [7]:
data

         Location
0      Location 3
1      Location 6
2      Location 8
3     Location 26
4     Location 34
...           ...
1038  Location 73
1039  Location 82
1040  Location 11
1041  Location 26
1042  Location 94

[1043 rows x 1 columns]

In [14]:
dataframe = pd.read_csv('./simple_csv.csv')

In [16]:
dataframe.index.name = 'ID'

In [17]:
dataframe

     Column1   Column2   Column3
ID
0   0.280925  0.910368  0.692982
1   0.719882  0.210024  0.761276
2   0.235752  0.059796  0.154667
3   0.603366  0.485614  0.013345
4   0.039985  0.236359  0.811832
5   0.015478  0.543641  0.112719
6   0.192540  0.409874  0.875082
7   0.380921  0.045468  0.515859
8   0.592471  0.786421  0.047249
9   0.072112  0.695694  0.409573
10  0.898072  0.070956  0.209020
11  0.722038  0.211985  0.324164
12  0.513517  0.091548  0.664279
13  0.436729  0.040322  0.548167
14  0.864039  0.963556  0.106398
15  0.724761  0.410422  0.587589
16  0.198926  0.245207  0.767356
17  0.748500  0.019264  0.046678
18  0.920639  0.212611  0.520463
19  0.452024  0.123660  0.847451
20  0.542977  0.265852  0.410926
21  0.355266  0.860616  0.589431
22  0.142688  0.406456  0.204095
23  0.850436  0.129426  0.719027
24  0.443476  0.388967  0.596924
25  0.467100  0.416908  0.098037
26  0.338536  0.935814  0.736899
27  0.942101  0.772005  0.441574
28  0.570130  0.780085  0.085592

## Common Attributes for Working with DataFrames

In [18]:
dataframe.head()

     Column1   Column2   Column3
ID
0   0.280925  0.910368  0.692982
1   0.719882  0.210024  0.761276
2   0.235752  0.059796  0.154667
3   0.603366  0.485614  0.013345
4   0.039985  0.236359  0.811832

In [19]:
dataframe.index

RangeIndex(start=0, stop=29, step=1, name='ID')

In [20]:
type(dataframe.index)

pandas.core.indexes.range.RangeIndex

In [21]:
dataframe.columns

Index(['Column1', 'Column2', 'Column3'], dtype='object')

In [22]:
type(dataframe.columns)

pandas.core.indexes.base.Index

In [23]:
dataframe.axes ## Informasi yg muncul index dan columns / gabungan keduanya

[RangeIndex(start=0, stop=29, step=1, name='ID'),
 Index(['Column1', 'Column2', 'Column3'], dtype='object')]

In [24]:
dataframe.dtypes

Column1    float64
Column2    float64
Column3    float64
dtype: object

In [25]:
dataframe.values

array([[0.28092541, 0.91036848, 0.69298188],
       [0.71988236, 0.21002407, 0.7612759 ],
       [0.23575208, 0.0597963 , 0.1546666 ],
       [0.60336627, 0.48561397, 0.01334502],
       [0.03998475, 0.23635865, 0.81183165],
       [0.01547756, 0.54364108, 0.11271945],
       [0.19253954, 0.40987429, 0.87508246],
       [0.3809206 , 0.04546771, 0.5158594 ],
       [0.59247137, 0.78642122, 0.04724929],
       [0.07211205, 0.69569385, 0.4095732 ],
       [0.89807238, 0.07095587, 0.20902018],
       [0.72203752, 0.21198538, 0.32416377],
       [0.51351671, 0.09154813, 0.66427856],
       [0.43672924, 0.04032155, 0.54816704],
       [0.86403942, 0.96355627, 0.10639842],
       [0.72476104, 0.41042245, 0.58758877],
       [0.19892576, 0.24520742, 0.76735595],
       [0.74849989, 0.01926363, 0.04667836],
       [0.92063933, 0.21261146, 0.52046319],
       [0.45202421, 0.12366004, 0.84745113],
       [0.54297722, 0.2658523 , 0.41092586],
       [0.35526598, 0.86061556, 0.58943068],
       [0.14268816, 0.40645578, 0.20409459],
       [0.85043648, 0.12942629, 0.71902732],
       [0.44347576, 0.38896746, 0.59692352],
       [0.46710041, 0.41690809, 0.09803679],
       [0.33853585, 0.93581422, 0.73689886],
       [0.94210097, 0.77200456, 0.44157427],
       [0.57012999, 0.78008526, 0.08559159]])

In [27]:
type(dataframe.values)

numpy.ndarray

In [28]:
dataframe.to_numpy() ## Ngubah array pandas ke numpy array

array([[0.28092541, 0.91036848, 0.69298188],
       [0.71988236, 0.21002407, 0.7612759 ],
       [0.23575208, 0.0597963 , 0.1546666 ],
       [0.60336627, 0.48561397, 0.01334502],
       [0.03998475, 0.23635865, 0.81183165],
       [0.01547756, 0.54364108, 0.11271945],
       [0.19253954, 0.40987429, 0.87508246],
       [0.3809206 , 0.04546771, 0.5158594 ],
       [0.59247137, 0.78642122, 0.04724929],
       [0.07211205, 0.69569385, 0.4095732 ],
       [0.89807238, 0.07095587, 0.20902018],
       [0.72203752, 0.21198538, 0.32416377],
       [0.51351671, 0.09154813, 0.66427856],
       [0.43672924, 0.04032155, 0.54816704],
       [0.86403942, 0.96355627, 0.10639842],
       [0.72476104, 0.41042245, 0.58758877],
       [0.19892576, 0.24520742, 0.76735595],
       [0.74849989, 0.01926363, 0.04667836],
       [0.92063933, 0.21261146, 0.52046319],
       [0.45202421, 0.12366004, 0.84745113],
       [0.54297722, 0.2658523 , 0.41092586],
       [0.35526598, 0.86061556, 0.58943068],
       [0.14268816, 0.40645578, 0.20409459],
       [0.85043648, 0.12942629, 0.71902732],
       [0.44347576, 0.38896746, 0.59692352],
       [0.46710041, 0.41690809, 0.09803679],
       [0.33853585, 0.93581422, 0.73689886],
       [0.94210097, 0.77200456, 0.44157427],
       [0.57012999, 0.78008526, 0.08559159]])

In [29]:
type(dataframe.to_numpy())

numpy.ndarray

In [30]:
dataframe.shape

(29, 3)

In [34]:
len(dataframe.columns) ## sama kaya shape tapi bisa kita pilih kolom atau baris A.K.A rows ( tapi yg dipakai index)

3

In [35]:
len(dataframe.index) ## Menghitung barisnya atau indexnya

29

## Data Selection in pandas DataFrames/subset

In [36]:
dataframe.head()

     Column1   Column2   Column3
ID
0   0.280925  0.910368  0.692982
1   0.719882  0.210024  0.761276
2   0.235752  0.059796  0.154667
3   0.603366  0.485614  0.013345
4   0.039985  0.236359  0.811832

In [39]:
dataframe.Column1.head() ## Yang keluar hanya kolom yang kita pilih/index kolomnya

ID
0    0.280925
1    0.719882
2    0.235752
3    0.603366
4    0.039985
Name: Column1, dtype: float64

In [41]:
dataframe["Column2"].head() ## Cara berbeda tapi hasilnya sama

ID
0    0.910368
1    0.210024
2    0.059796
3    0.485614
4    0.236359
Name: Column2, dtype: float64

In [42]:
dataframe[['Column1','Column2']].head() ## Kalau mau ambil lebih dari 1 kolom [] harus dua

     Column1   Column2
ID
0   0.280925  0.910368
1   0.719882  0.210024
2   0.235752  0.059796
3   0.603366  0.485614
4   0.039985  0.236359

In [44]:
dataframe[['Column1']].head() ## Kurung [] di doble bikin hasilnya datanya lebih bagus

     Column1
ID
0   0.280925
1   0.719882
2   0.235752
3   0.603366
4   0.039985

In [45]:
dataframe_k1_k2 = dataframe[['Column1','Column2']] ## Ini kalau kita mau buat datayg sdh kita subset ke sebuah variabel/data berbeda

In [47]:
dataframe_k1_k2.head()

     Column1   Column2
ID
0   0.280925  0.910368
1   0.719882  0.210024
2   0.235752  0.059796
3   0.603366  0.485614
4   0.039985  0.236359

## Data Selection - Indexing with .iloc[] ** PENTING

In [50]:
dataframe.head()

     Column1   Column2   Column3
ID
0   0.280925  0.910368  0.692982
1   0.719882  0.210024  0.761276
2   0.235752  0.059796  0.154667
3   0.603366  0.485614  0.013345
4   0.039985  0.236359  0.811832

In [48]:
dataframe.iloc[1,2] ## I artinya index, loc artinya lokasi iloc = indexing location

0.761275905

In [51]:
dataframe.iloc[1,:] ## Yang sebelah kiri koma cari berdasarkan index baris | yang kanan indexing berdasarkan kolom
                    ## : artinya semua kolom dan 1 artinya baris ke 1

Column1    0.719882
Column2    0.210024
Column3    0.761276
Name: 1, dtype: float64

In [52]:
dataframe.iloc[[2,3]] ## Kurungnya dua bisa bikin hasil keluar lebih bagus

     Column1   Column2   Column3
ID
2   0.235752  0.059796  0.154667
3   0.603366  0.485614  0.013345

In [53]:
dataframe.iloc[[1,3,4],:] ## Ini kalau barisnya lebih dari 1 atau sebaliknya

     Column1   Column2   Column3
ID
1   0.719882  0.210024  0.761276
3   0.603366  0.485614  0.013345
4   0.039985  0.236359  0.811832

In [58]:
dataframe.iloc[:,[1,2]].head()

     Column2   Column3
ID
0   0.910368  0.692982
1   0.210024  0.761276
2   0.059796  0.154667
3   0.485614  0.013345
4   0.236359  0.811832

In [60]:
dataframe.iloc[[1,2,3,4],[0,1,2]] ## Begini juga bisa

     Column1   Column2   Column3
ID
1   0.719882  0.210024  0.761276
2   0.235752  0.059796  0.154667
3   0.603366  0.485614  0.013345
4   0.039985  0.236359  0.811832

## Data Selection - Indexing with .loc[]

In [61]:
dataframe.head()

     Column1   Column2   Column3
ID
0   0.280925  0.910368  0.692982
1   0.719882  0.210024  0.761276
2   0.235752  0.059796  0.154667
3   0.603366  0.485614  0.013345
4   0.039985  0.236359  0.811832

## Bedanya biar lebih akurat/pakai string/hurup | Penggunaannya sama dengan iloc cuma bedanya bisa string

In [62]:
dataframe.loc[4]

Column1    0.039985
Column2    0.236359
Column3    0.811832
Name: 4, dtype: float64

In [66]:
dataframe.loc[1,"Column1"] ## Ini dia tidak pakai Index makanya namanya loc = location aja bukan iloc

0.719882356

## A Few Comments on Using .loc[] and .iloc[]